---
kind: property
id: P:Autodesk.Revit.DB.PDFExportOptions.RasterQuality
source: html/e5b82a4c-4585-dc83-74d3-ce544d66c1fb.htm
---
# Autodesk.Revit.DB.PDFExportOptions.RasterQuality Property

The preferred raster quality (DPI).

## Syntax (C#)
```csharp
public RasterQualityType RasterQuality { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration